Tekla Open API Reference for Tekla Structures 2025
RebarSpacing.StartOffset Property
 Gets or sets the proposed offset to the first reinforcing bar from the start of the RebarGuideline.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double StartOffset { get; set; }
Public Property StartOffset As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarSpacing Class
Tekla.Structures.Model Namespace